KingKoro/CH32VX-USB-Serial-PIO-Library/lib/CH32V_USB_SERIAL/ch32v_usb_serial.c
/**
 *  CH32VX USB Serial Library
 *
 *  Copyright (c) 2024 Florian Korotschenko aka KingKoro
 *
 *  Permission is hereby granted, free of charge, to any person obtaining a copy
 *  of this software and associated documentation files (the "Software"), to deal
 *  in the Software without restriction, including without limitation the rights
 *  to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 *  copies of the Software, and to permit persons to whom the Software is
 *  furnished to do so, subject to the following conditions:
 *
 *  The above copyright notice and this permission notice shall be included in
 *  all copies or substantial portions of the Software.
 *
 *  THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 *  IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 *  FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 *  AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 *  LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 *  OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 *  THE SOFTWARE.
 *
 *
 *  file         : ch32v_usb_serial.c
 *  description  : usb serial library main code
 *
 */

#include "ch32v_usb_serial.h"

/*******************************************************************************/
/* Variable Definition */
/* Global */

uint8_t USB_Rx_wait = 0; // Store wether to wait for usb to receive input
char packet_buf[64];
int packet_left = 0;
int packet_pos = 0;

// Track temporary float string-buffer
uint16_t tmp_fbuf_pos = 0;                  // position in buffer
char tmp_fbuf[TMP_FBUF_SIZE];               // temporary float string-buffer = 8 slots x 16 chars

/* The following are serial port transmit and receive related variables and buffers */
volatile UART_CTL Uart;

__attribute__ ((aligned(4))) uint8_t  UART2_Tx_Buf[ DEF_UARTx_TX_BUF_LEN ];  /* Serial port 2 transmit data buffer */

extern uint8_t USBD_Endp3_Busy;

// Global buffer and tracking variables for async mode
#if(USB_TX_MODE == USB_TX_ASYNC)
    uint16_t USB_Tx_async_sendindex;                                                    /* Index of next Byte to send */
    uint16_t USB_Tx_async_writeindex;                                                   /* Index of next Byte to write */
    uint16_t USB_Tx_async_num_tosend;                                                   /* Number of Bytes, waiting to be send */
    __attribute__ ((aligned(4))) uint8_t USB_Tx_async_buffer[USB_TX_ASYNC_BUFSIZE];     /* Hold TX Data (FIFO-Style) before sending */
    _Atomic int tx_semaphore = 0;                                                       /* This shared variable locks USB_Tx_runner() (TIM2) interrupt out from sending during write operation into async send buffer _putchar() */
#endif

/*********************************************************************
 * @fn      RCC_Configuration
 *
 * @brief   Configures the different system clocks.
 *
 * @return  none
 */
uint8_t RCC_Configuration( void )
{
    RCC_APB2PeriphClockCmd( RCC_APB2Periph_GPIOA, ENABLE );
    RCC_APB1PeriphClockCmd( RCC_APB1Periph_USART2, ENABLE );

    #if defined(CH32V10X)
        RCC_APB1PeriphClockCmd( RCC_APB1Periph_TIM2, ENABLE );
    #elif defined(CH32V20X)
        RCC_APB1PeriphClockCmd( RCC_APB1Periph_TIM2, ENABLE );
    #elif defined(CH32V30X)
        RCC_APB1PeriphClockCmd( RCC_APB1Periph_TIM2, ENABLE );
    #elif defined(CH32X035) || defined(CH32X033)
        RCC_APB1PeriphClockCmd( RCC_APB1Periph_TIM3, ENABLE );
    #endif
    
    RCC_AHBPeriphClockCmd( RCC_AHBPeriph_DMA1, ENABLE );
    return 0;
}

#if defined(CH32V20X) || defined(CH32V10X) || defined(CH32V30X)
/*********************************************************************
 * @fn      TIM2_Init
 *
 * @brief   10us Timer
 *          144 * 10 * 13.8888 -----> 10uS
 *
 * @return  none
 */
void TIM2_Init( void )
{
    TIM_TimeBaseInitTypeDef  TIM_TimeBaseStructure = {0};

    TIM_DeInit( TIM2 );

    /* Time base configuration */
    TIM_TimeBaseStructure.TIM_Period = 10 - 1; // TIM2 Period: Max value to count till interrupt -> 1 MHz / 10 = 100K -> 10us between interrupt
    TIM_TimeBaseStructure.TIM_Prescaler = SystemCoreClock / 1000000 - 1; // TIM2 Prescaler: Divide Systemclock by (itself/1M) -> Now 1MHz Tick-rate for timer
    TIM_TimeBaseStructure.TIM_ClockDivision = 0;
    TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
    TIM_TimeBaseInit( TIM2, &TIM_TimeBaseStructure );

    /* Clear TIM2 update pending flag */
    TIM_ClearFlag( TIM2, TIM_FLAG_Update );

    /* TIM IT enable */
    TIM_ITConfig( TIM2, TIM_IT_Update, ENABLE );

    /* Enable Interrupt */
    NVIC_EnableIRQ( TIM2_IRQn );

    /* TIM2 enable counter */
    TIM_Cmd( TIM2, ENABLE );
}
#elif defined(CH32X035) || defined(CH32X033)
/*********************************************************************
 * @fn      TIM3_Init
 *
 * @brief   10us Timer
 *          144 * 10 * 13.8888 -----> 10uS
 *
 * @return  none
 */
void TIM3_Init( void )
{
    TIM_TimeBaseInitTypeDef  TIM_TimeBaseStructure = {0};

    TIM_DeInit( TIM3 );

    /* Time base configuration */
    TIM_TimeBaseStructure.TIM_Period = 10 - 1;
    TIM_TimeBaseStructure.TIM_Prescaler = SystemCoreClock / 1000000 - 1;
    TIM_TimeBaseStructure.TIM_ClockDivision = 0;
    TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
    TIM_TimeBaseInit( TIM3, &TIM_TimeBaseStructure );

    /* Clear TIM3 update pending flag */
    TIM_ClearFlag( TIM3, TIM_FLAG_Update );

    /* TIM IT enable */
    TIM_ITConfig( TIM3, TIM_IT_Update, ENABLE );

    /* Enable Interrupt */
    NVIC_EnableIRQ( TIM3_IRQn );

    /* TIM3 enable counter */
    TIM_Cmd( TIM3, ENABLE );
}
#endif



/*********************************************************************
 * @fn      UART2_ParaInit
 *
 * @brief   Uart2 parameters initialization
 *          mode = 0 : Used in usb modify initialization
 *          mode = 1 : Used in default initializations
 * @return  none
 */
void UART2_ParaInit( uint8_t mode )
{
    uint8_t i;

