KingKoro/CH32VX-USB-Serial-PIO-Library/lib/CH32V_USB_SERIAL/ch32v_usb_serial.c
    Uart.Rx_TimeOut = 0x00;
    Uart.Rx_TimeOutMax = 30;

    Uart.Tx_LoadNum = 0x00;
    Uart.Tx_DealNum = 0x00;
    Uart.Tx_RemainNum = 0x00;
    for( i = 0; i < DEF_UARTx_TX_BUF_NUM_MAX; i++ )
    {
        Uart.Tx_PackLen[ i ] = 0x00;
        Uart.Tx_PackPos[ i ] = 0x00;
    }

    Uart.USB_Up_IngFlag = 0x00;
    Uart.USB_Up_TimeOut = 0x00;
    Uart.USB_Down_StopFlag = 0x00;

    if( mode )
    {
        Uart.Com_Cfg[ 0 ] = (uint8_t)( DEF_UARTx_BAUDRATE );
        Uart.Com_Cfg[ 1 ] = (uint8_t)( DEF_UARTx_BAUDRATE >> 8 );
        Uart.Com_Cfg[ 2 ] = (uint8_t)( DEF_UARTx_BAUDRATE >> 16 );
        Uart.Com_Cfg[ 3 ] = (uint8_t)( DEF_UARTx_BAUDRATE >> 24 );
        Uart.Com_Cfg[ 4 ] = DEF_UARTx_STOPBIT;
        Uart.Com_Cfg[ 5 ] = DEF_UARTx_PARITY;
        Uart.Com_Cfg[ 6 ] = DEF_UARTx_DATABIT;
        Uart.Com_Cfg[ 7 ] = DEF_UARTx_RX_TIMEOUT;
    }
}

/*********************************************************************
 * @fn      UART2_USB_Init
 *
 * @brief   Uart2 initialization in usb interrupt
 *
 * @return  none
 */
void UART2_USB_Init( void )
{
    uint32_t baudrate;
    //uint8_t  stopbits;
    //uint8_t  parity;

    baudrate = ( uint32_t )( Uart.Com_Cfg[ 3 ] << 24 ) + ( uint32_t )( Uart.Com_Cfg[ 2 ] << 16 );
    baudrate += ( uint32_t )( Uart.Com_Cfg[ 1 ] << 8 ) + ( uint32_t )( Uart.Com_Cfg[ 0 ] );
    //stopbits = Uart.Com_Cfg[ 4 ];
    //parity = Uart.Com_Cfg[ 5 ];

    UART2_ParaInit( 0 );

    /* restart usb receive  */
    #if defined(CH32V10X)
        R16_UEP2_DMA = (uint16_t)(uint32_t)(uint8_t *)&UART2_Tx_Buf[ 0 ];
        R8_UEP2_CTRL = (R8_UEP2_CTRL & ~MASK_UEP_R_RES) | UEP_R_RES_ACK;
    #elif defined(CH32V20X)
        #if(USB_CDCPORT == CDC_USBFS)
            USBOTG_FS->UEP2_DMA = (uint32_t)(uint8_t *)&UART2_Tx_Buf[ 0 ];
            USBOTG_FS->UEP2_RX_CTRL &= ~USBFS_UEP_R_RES_MASK;
            USBOTG_FS->UEP2_RX_CTRL |= USBFS_UEP_R_RES_ACK;
        #endif
    #elif defined(CH32V30X)
        USBHSD->UEP2_RX_DMA = (uint32_t)(uint8_t *)&UART2_Tx_Buf[ 0 ];
        USBHSD->UEP2_RX_CTRL &= ~USBFS_UEP_R_RES_MASK;
        USBHSD->UEP2_RX_CTRL |= USBFS_UEP_R_RES_ACK;
    #elif defined(CH32X035) || defined(CH32X033)
        USBFSD->UEP2_DMA = (uint32_t)(uint8_t *)&UART2_Tx_Buf[ 0 ];
        USBFSD->UEP2_CTRL_H &= ~USBFS_UEP_R_RES_MASK;
        USBFSD->UEP2_CTRL_H |= USBFS_UEP_R_RES_ACK;
    #endif
}

/*********************************************************************
 * @fn      USB_Serial_initialize
 *
 * @brief   Initializes USB Serial interface with configured parameters (see ch32v_usb_serial.h).
 *
 * @return  none
 */
void USB_Serial_initialize()
{
    RCC_Configuration( );

    #if defined(CH32V10X)
        TIM2_Init( );
    #elif defined(CH32V20X)
        TIM2_Init( );
    #elif defined(CH32V30X)
        TIM2_Init( );
    #elif defined(CH32X035) || defined(CH32X033)
        TIM3_Init( );
    #endif
    
    UART2_ParaInit( 1 );
    #if(USB_CDCPORT == CDC_USBFS)
        /* USB20 device init */
        USBFS_RCC_Init( );
        #if defined(CH32V10X)
            USBFS_Device_Init( ENABLE , PWR_VDD_SupplyVoltage());
        #elif defined(CH32V20X)
            USBFS_Device_Init( ENABLE );
        #elif defined(CH32V30X)
            USBFS_Device_Init( ENABLE );
        #elif defined(CH32X035) || defined(CH32X033)
            USBFS_Device_Init( ENABLE , PWR_VDD_SupplyVoltage());
        #endif
    #else
        #if defined(CH32V20X)
            Set_USBConfig(); 
            USB_Init();	    
 	        USB_Interrupts_Config();
        #elif defined(CH32V30X)
            USBHS_Device_Init( ENABLE );
        #endif
    #endif
    // Initialize tracking variables for async tx buffer
    #if(USB_TX_MODE == USB_TX_ASYNC)
        USB_Tx_async_sendindex = 0;                                    
        USB_Tx_async_writeindex = 0;                                   
        USB_Tx_async_num_tosend = 0;
    #endif
}

/*********************************************************************
 * @fn      handle_USB_Error
 *
 * @brief   Handle USB Error code by printing error message to debug UART channel.
 * 
 * @param   code Error code to handle.
 *
 * @return  none
 */
void handle_USB_Error(uint8_t code)
{
    if(code == USB_ERROR) printf("[ERROR] USB_ERROR returned\r\n");
    else if(code == USB_UNSUPPORT) printf("[ERROR] USB_UNSUPPORT returned\r\n");
    else if(code == USB_NOT_READY) printf("[ERROR] USB_NOT_READY returned\r\n");
    else if(code != USB_SUCCESS) printf("[ERROR] Unknown USB Issue returned\r\n");
}

/*********************************************************************
 * @fn      USB_disable_IRQ
 *
 * @brief   Disable USB IRQ and allow for modification read/write operation from/to USB endpoint.
 *
 * @return  none
 */
void USB_disable_IRQ()
{
    // USB Interrupt deactivate
    #if(USB_CDCPORT == CDC_USBFS)
        #if defined(CH32V10X)
            NVIC_DisableIRQ( USBHD_IRQn );
        #elif defined(CH32X035) || defined(CH32X033)
            NVIC_DisableIRQ( USBFS_IRQn );
        #elif defined(CH32V20X)
            NVIC_DisableIRQ( USBFS_IRQn );
            NVIC_DisableIRQ( USBHD_IRQn );
        #elif defined(CH32V30X)
            NVIC_DisableIRQ( OTG_FS_IRQn );
            NVIC_DisableIRQ( OTG_FS_IRQn );
        #endif
    #else
        #if defined(CH32V20X)
            NVIC_DisableIRQ( USB_LP_CAN1_RX0_IRQn );
            NVIC_DisableIRQ( USB_HP_CAN1_TX_IRQn );
        #elif defined(CH32V30X)
            NVIC_DisableIRQ( USBHS_IRQn );
            NVIC_DisableIRQ( USBHS_IRQn );
        #endif
    #endif
}

/*********************************************************************
 * @fn      USB_enable_IRQ
 *
 * @brief   Enable USB IRQ and allow for USB endpoint to operate again.
 *
 * @return  none
 */
void USB_enable_IRQ()
{
    // USB Interrupt activate
    #if(USB_CDCPORT == CDC_USBFS)
        #if defined(CH32V10X)
            NVIC_EnableIRQ( USBHD_IRQn );
        #elif defined(CH32X035) || defined(CH32X033)
            NVIC_EnableIRQ( USBFS_IRQn );
        #elif defined(CH32V20X)
            NVIC_EnableIRQ( USBFS_IRQn );
            NVIC_EnableIRQ( USBHD_IRQn );
        #elif defined(CH32V30X)
            NVIC_EnableIRQ( OTG_FS_IRQn );
        #endif
    #else
        #if defined(CH32V20X)
            NVIC_EnableIRQ( USB_LP_CAN1_RX0_IRQn );
            NVIC_EnableIRQ( USB_HP_CAN1_TX_IRQn );
        #elif defined(CH32V30X)
            NVIC_EnableIRQ( USBHS_IRQn );
        #endif
    #endif  
}

/*********************************************************************
 * @fn      USB_restart_downlink
 *
 * @brief   If the current serial port has suspended the downlink, restart the driver downlink.
 *
 * @return  none
 */
void USB_restart_downlink()
{
    #if defined(CH32V10X)
        R8_UEP2_CTRL = (R8_UEP2_CTRL & ~MASK_UEP_R_RES) | UEP_R_RES_ACK;
    #elif defined(CH32V20X)
        #if(USB_CDCPORT == CDC_USBFS)
            USBFSD->UEP2_RX_CTRL &= ~USBFS_UEP_R_RES_MASK;
            USBFSD->UEP2_RX_CTRL |= USBFS_UEP_R_RES_ACK;
        #else
            SetEPRxValid( ENDP2 );
        #endif
    #elif defined(CH32V30X)
        USBHSD->UEP2_RX_CTRL &= ~USBFS_UEP_R_RES_MASK;
        USBHSD->UEP2_RX_CTRL |= USBFS_UEP_R_RES_ACK;
    #elif defined(CH32X035) || defined(CH32X033)
        USBFSD->UEP2_CTRL_H &= ~USBFS_UEP_R_RES_MASK;
        USBFSD->UEP2_CTRL_H |= USBFS_UEP_R_RES_ACK;
    #endif
    Uart.USB_Down_StopFlag = 0x00; // If buffer close to beeing 100% free and RX closed, open USB RX again
}

uint8_t USBx_ENDP3_DataUp( uint8_t *pbuf, uint16_t len )
{
    uint8_t success = USB_ERROR;
    #if(USB_CDCPORT == CDC_USBFS)
        USB_disable_IRQ();
        Uart.USB_Up_IngFlag = 0x01; // Paket upload flag, automatically de-asserted by EP3 IN-Callback on USB-D / Interrrupt on USB-FS
        Uart.USB_Up_TimeOut = 0x00; // Reset USB-TX Timeout (automatically counted up by TIM2 Interrupt)
        success = USBFS_Endp_DataUp( DEF_UEP3, pbuf, len, DEF_UEP_CPY_LOAD ); // Send data to USB Endpoint
        USB_enable_IRQ();
    #else
        #if defined(CH32V20X)
            USB_disable_IRQ();
            Uart.USB_Up_IngFlag = 0x01; // Paket upload flag, automatically de-asserted by EP3 IN-Callback on USB-D / Interrrupt on USB-FS
            Uart.USB_Up_TimeOut = 0x00; // Reset USB-TX Timeout (automatically counted up by TIM2 Interrupt)
            success = USBD_ENDPx_DataUp( ENDP3, pbuf, len); // Send data to USB Endpoint
            USB_enable_IRQ();
        #elif defined(CH32V30X)
            success = USB_SUCCESS;
            USB_disable_IRQ();
            Uart.USB_Up_IngFlag = 0x01; // Paket upload flag, automatically de-asserted by EP3 IN-Callback on USB-D / Interrrupt on USB-FS
            Uart.USB_Up_TimeOut = 0x00; // Reset USB-TX Timeout (automatically counted up by TIM2 Interrupt)
            USBHSD->UEP2_TX_DMA = (uint32_t)(uint8_t *)pbuf;
            USBHSD->UEP2_TX_LEN  = len;
            USBHSD->UEP2_TX_CTRL &= ~USBHS_UEP_T_RES_MASK;
            USBHSD->UEP2_TX_CTRL |= USBHS_UEP_T_RES_ACK;
            USB_enable_IRQ();
        #endif
    #endif
    handle_USB_Error(success); // Handle possible errors in transmission
    return success;
}

/*********************************************************************
 * @fn      USB_Rx_flush
 *
 * @brief   Flush and reset USB RX buffer
 * 
 * @return  none
 */
void USB_Rx_flush()
{
    // USB Interrupt deactivate
    USB_disable_IRQ();

    // Reset PackLen to 0
    for(uint16_t i = 0; i < DEF_UARTx_TX_BUF_NUM_MAX; i++)
    {
        Uart.Tx_PackLen[ i ] = 0x00;
        Uart.Tx_PackPos[ i ] = 0x00;
    }
    // Reset Packet-tracking parameters
    Uart.Tx_LoadNum = 0x00;
    Uart.Tx_DealNum = 0x00;
    Uart.Tx_RemainNum = 0x00;

    // USB Interrupt activate
    USB_enable_IRQ();
}

#if(USB_TX_MODE == USB_TX_ASYNC)

/*********************************************************************
 * @fn      USB_Tx_runner
 *
 * @brief   If USB_TX_MODE is USB_TX_ASYNC, this function needs to be called repeatadly in a while loop to
 *          send queued data via USB. Does not wait for USB TX availability.
 *
 * @return  none
 */
void USB_Tx_runner()
{
    //printf("USB_Tx_runner() called ...\r\n");
    if(USB_Tx_async_num_tosend > 0)
    {
        // If USB Tx ready, send data, otherwise omit this call ...
        if(Uart.USB_Up_IngFlag == 0)
        {
            uint16_t send_this_run = DEF_USB_FS_PACK_LEN; // Number of bytes to send in this run
            // If possible, send 64-Byte Chunk at once
            if(USB_Tx_async_num_tosend < DEF_USB_FS_PACK_LEN)
            {
                send_this_run = USB_Tx_async_num_tosend;
            }
            // If not send only as many as available to send, or till wrap-around of buffer
            if((USB_Tx_async_sendindex + send_this_run) >= USB_TX_ASYNC_BUFSIZE)
            {
                send_this_run = USB_TX_ASYNC_BUFSIZE - USB_Tx_async_sendindex;
            }
            // Send full data via USB
            USBx_ENDP3_DataUp( &USB_Tx_async_buffer[USB_Tx_async_sendindex], send_this_run );
            // Update Send Index and Num to send
            USB_Tx_async_sendindex += send_this_run;
            USB_Tx_async_num_tosend -= send_this_run;
            // Debug
            //printf("USB_Tx_runner() sent %d Bytes from sendindex: %d ... \r\n", send_this_run, USB_Tx_async_sendindex);
            //printf("USB_Tx_runner() writeindex is %d , Num to send: %d \r\n", USB_Tx_async_writeindex, USB_Tx_async_num_tosend);
            // If sendindex wrap-around, reset to 0
            if(USB_Tx_async_sendindex >= USB_TX_ASYNC_BUFSIZE)
            {
                USB_Tx_async_sendindex = 0;
            }
        }
        else
        {
            // ... unless USB Tx timeout is reached, then reset busy-flag so next transmit can happen
            /* Set the upload success flag directly if the previous upload is not successful after the timeout */
            if( Uart.USB_Up_TimeOut >= DEF_UARTx_USB_UP_TIMEOUT )
            {
                Uart.USB_Up_IngFlag = 0x00;
                #if(USB_CDCPORT == CDC_USBFS)
                    #if defined(CH32V30X)
                        USBFS_Endp_Busy[ DEF_UEP3 ] = 0;
                    #else
                        USBFS_Endp_Busy[ DEF_UEP3 ] = 0;
                    #endif
                #else
                    #if defined(CH32V30X)
                        USBHS_Endp_Busy[ DEF_UEP2 ] = 0;
                    #else
                        USBD_Endp3_Busy = 0;
                    #endif
                #endif
            }
        }
        
