KingKoro/CH32VX-USB-Serial-PIO-Library/lib/CH32V_USB_SERIAL/ch32v_usb_serial.c
    }
}

/*********************************************************************
 * @fn      USB_Tx_flush
 *
 * @brief   Flush and reset USB TX buffer
 * 
 * @return  none
 */
void USB_Tx_flush()
{
   USB_Tx_async_num_tosend = 0;
   USB_Tx_async_sendindex = USB_Tx_async_writeindex;
}

#endif

/*********************************************************************
 * @fn      _putchar
 *
 * @brief   Print a single character to USB TX
 * 
 * @param   character      Character to print
 *
 * @return  none
 */
void _putchar(char character)
{
    uint8_t unsigned_character = (uint8_t)(character);

    #if(USB_TX_MODE == USB_TX_ASYNC)
        // Disable Async USB_Tx_runner() during writing
        tx_semaphore = 1;
        // If asynchronous TX mode, do not wait for TX availability, only store into TX buffer
        // Write Data from buffer into USB_Tx_async_buffer
        // Wrap-around write index to 0 if end of Buffer reached
        if(USB_Tx_async_writeindex >= USB_TX_ASYNC_BUFSIZE)
        {
            USB_Tx_async_writeindex = 0;
        }
        // Write Byte and increment write index 
        USB_Tx_async_buffer[USB_Tx_async_writeindex] = unsigned_character;
        USB_Tx_async_writeindex++;
        // Update number of bytes to send
        USB_Tx_async_num_tosend = USB_Tx_async_writeindex - USB_Tx_async_sendindex;
        if(USB_Tx_async_num_tosend < 0)
        {
            USB_Tx_async_num_tosend = ( USB_TX_ASYNC_BUFSIZE - USB_Tx_async_sendindex ) + USB_Tx_async_writeindex;
        }
        // Enable Async USB_Tx_runner() again
        tx_semaphore = 0;
        
    #else
        // If synchronous TX mode, wait for TX availability or timeout, then send character
        while(Uart.USB_Up_IngFlag != 0)
        {
            // Wait for Endpoint to be ready for transmit
            /* Set the upload success flag directly if the previous upload is not successful after the timeout */
            if( Uart.USB_Up_TimeOut >= DEF_UARTx_USB_UP_TIMEOUT )
            {
                Uart.USB_Up_IngFlag = 0x00;
                #if(USB_CDCPORT == CDC_USBFS)
                    USBFS_Endp_Busy[ DEF_UEP3 ] = 0;
                #else
                    USBD_Endp3_Busy = 0;
                #endif
                break;
            }
        }
        USBx_ENDP3_DataUp( &unsigned_character, (uint16_t)1 );
    #endif
}

/*********************************************************************
 * @fn      USB_Rx_set_wait
 *
 * @brief   Set variable for getch() wait, if set to x > 0, getch() will wait if no data in USB RX buffer (useful for CLI terminal emulation)
 * 
 * @param   setval      Set wether to wait ( x > 0) or not wait (x = 0)
 *
 * @return  none
 */
void USB_Rx_set_wait(uint8_t setval)
{
    USB_Rx_wait = setval;
}

/*********************************************************************
 * @fn      _readch
 *
 * @brief   Internal read character function
 * 
 * @return  Received character as integer
 */
int _readch()
{
    int buf;

    if(Uart.Tx_PackPos[Uart.Tx_DealNum] >= DEF_USB_FS_PACK_LEN)
    {
        Uart.Tx_PackPos[Uart.Tx_DealNum] = 0;
    }
    if(Uart.Tx_DealNum >= 16)
    {
        Uart.Tx_DealNum = 0;
    }
    buf = (int)UART2_Tx_Buf[ ( (Uart.Tx_DealNum * DEF_USB_FS_PACK_LEN) + Uart.Tx_PackPos[Uart.Tx_DealNum]) ];
    Uart.Tx_PackLen[Uart.Tx_DealNum]--;         // Update Packet length
    Uart.Tx_PackPos[Uart.Tx_DealNum]++;         // Update Packet read position
    // If end of packet reached
    if(Uart.Tx_PackLen[Uart.Tx_DealNum] <= 0)
    {
        Uart.Tx_PackPos[Uart.Tx_DealNum] = 0;       // Reset Packet read position on leaving packet
        Uart.Tx_RemainNum--;                        // One less Load to process now
        Uart.Tx_DealNum++;                          // Increment number of next
        if( Uart.Tx_DealNum >= DEF_UARTx_TX_BUF_NUM_MAX )
        {
            Uart.Tx_DealNum = 0x00; // Wrap-around when limit of num of reads reached
        }     
    }
    return buf;
}

/*********************************************************************
 * @fn      getch
 *
 * @brief   Read a character from USB RX buffer
 * 
 * @return  Received character as integer
 */
int getch()
{
    int buf;

    if (USB_Rx_wait)
    {
        // --------- Do Wait ----------
        while ( Uart.Tx_PackLen[Uart.Tx_DealNum] <= 0 )
        {
        }
        // USB Interrupt deactivate
        USB_disable_IRQ();
        buf = _readch();
        #ifdef GETCH_CLI_FEEDBACK
            _putchar((char)buf); // Print read char into console as feedback to user (print out previous unsent tx data as well)
        #endif
    }
    else
    {
        // --------- Do not Wait ----------
        if(Uart.Tx_PackLen[Uart.Tx_DealNum] > 0)
        {
            // Packet is not empty, copy content into buf
            // USB Interrupt deactivate
            USB_disable_IRQ();
            buf = _readch();
            #ifdef GETCH_CLI_FEEDBACK
                _putchar((char)buf); // Print read char into console as feedback to user (print out previous unsent tx data as well)
            #endif
        }
        else
        {
            // If next packet has no data yet, do not wait and just return 0
            buf = 0;
        }  
    }

    #if(USB_RX_OVERFLOW == USB_RX_HALT)
        // If the current serial port has suspended the downlink, restart the driver downlink
        if( ( Uart.USB_Down_StopFlag == 0x01 ) && ( Uart.Tx_RemainNum < 2 ) )
        {
            USB_restart_downlink();
        }
    #endif

    // USB Interrupt activate
    USB_enable_IRQ();

    return buf;
}

/*********************************************************************
 * @fn      _USB_Serial_print_buffer
 *
 * @brief   Print buffer via USB serial (waits for USB TX availability in sync-mode), 
 *          if USB_TX_MODE is USB_TX_ASYNC, this only queues data to print and returns immediatly.
 * 
 * @param   buffer      Char Buffer to print.
 * @param   length      Number of chars from buffer to print.
 * @param   start_index Starting index in buffer to begin printing from.
 *
 * @return  none
 */
void _USB_Serial_print_buffer(char buffer[], uint16_t length, uint16_t start_index)
{
    #if(USB_TX_MODE == USB_TX_ASYNC)
        uint8_t * uint_buffer = (uint8_t*)buffer + start_index;
        // Write Data from buffer into USB_Tx_async_buffer
        for(uint16_t i = 0; i < length; i++)
        {
            // Wrap-around write index to 0 if end of Buffer reached
            if(USB_Tx_async_writeindex >= USB_TX_ASYNC_BUFSIZE)
            {
                USB_Tx_async_writeindex = 0;
            }
            // Write Byte and increment write index 
            USB_Tx_async_buffer[USB_Tx_async_writeindex] = uint_buffer[i];
            USB_Tx_async_writeindex++;
        }
        // Update number of bytes to send
        USB_Tx_async_num_tosend += length;
    #else
        uint8_t success = USB_ERROR;
        uint8_t * uint_buffer = (uint8_t*)buffer + start_index;

        if(length > 0)
        {
            // USBD and USBFS Device Endpoint can only send 64-Bytes at once, split buffer up and send in 64-byte chunks
            uint16_t remaining_bytes = length;
            uint16_t index = 0;
            while(remaining_bytes > 0)
            {
                uint16_t local_start_index = index * DEF_USB_FS_PACK_LEN;
                uint16_t num_to_send = length - local_start_index;
                if (num_to_send > DEF_USB_FS_PACK_LEN)
                {
                    while(Uart.USB_Up_IngFlag != 0)
                    {
                        // Wait for Endpoint to be ready for transmit
                        /* Set the upload success flag directly if the previous upload is not successful after the timeout */
                        if( Uart.USB_Up_TimeOut >= DEF_UARTx_USB_UP_TIMEOUT )
                        {
                            Uart.USB_Up_IngFlag = 0x00;
                            #if(USB_CDCPORT == CDC_USBFS)
                                USBFS_Endp_Busy[ DEF_UEP3 ] = 0;
                            #else
                                USBD_Endp3_Busy = 0;
                            #endif
                            break;
                        }
                    }
                    // Send full 64-byte Package
                    success = USBx_ENDP3_DataUp( &uint_buffer[local_start_index], DEF_USB_FS_PACK_LEN );
                    remaining_bytes -= DEF_USB_FS_PACK_LEN;
                }
                else
                {
                    while(Uart.USB_Up_IngFlag != 0)
                    {
                        // Wait for Endpoint to be ready for transmit
                        /* Set the upload success flag directly if the previous upload is not successful after the timeout */
                        if( Uart.USB_Up_TimeOut >= DEF_UARTx_USB_UP_TIMEOUT )
                        {
                            Uart.USB_Up_IngFlag = 0x00;
                            #if(USB_CDCPORT == CDC_USBFS)
                                USBFS_Endp_Busy[ DEF_UEP3 ] = 0;
                            #else
                                USBD_Endp3_Busy = 0;
                            #endif
                            break;
                        }
                    }
                    // Send the remaining bytes
                    success = USBx_ENDP3_DataUp( &uint_buffer[local_start_index], num_to_send );
                    remaining_bytes -= num_to_send;
                }
                index++;
            }
        }
    #endif
}

/*********************************************************************
 * @fn      USB_Serial_printf
 *
 * @brief   Works like a regular printf function. Prints data to USB serial, requires USB_Tx_runner() if USB_TX_MODE is USB_TX_ASYNC.
 * 
 * @param   format Format String with specifiers. Additional arguments possible.
 *
 * @return  Number of characters printed.
 */
uint16_t USB_Serial_printf(char *format, ...)
{
    va_list args;
    char buffer[USB_TX_BUFF_SIZE];
    uint16_t count = 0;

    va_start(args, format);

    count += (uint16_t)vsnprintf(buffer, sizeof(buffer), format, args);     // convert to string and write into buffer
    _USB_Serial_print_buffer(buffer, count, 0);                             // write/queue string for USB TX

    va_end(args);
    return count;
}

/*********************************************************************
 * @fn      ftoa_s
 *
 * @brief   Convert a double variable into a string that represents it's value. Works similar to ftoa().
 *          WARNING: This function uses a ringbuffer, and can only convert up to TMP_FSTR_NUM doubles at once
 *                      (as per in a single printf() call). Each double must be smaller than TMP_FSTR_SIZE in number of characters to represent.
 * 
 * @param   val         Double value to convert to string.
 * @param   precision   The number of decimals after the '.' to include.
 *
 * @return  A string that represents val. (Held in ringbuffer only till overwritte by new values)
 */
char * ftoa_s(double val, int precision)
{
    char * fstr_ptr = &tmp_fbuf[tmp_fbuf_pos * TMP_FSTR_SIZE];
    ftoa(val, fstr_ptr, precision, 1);                 // Convert float to str and write into fbuf
    tmp_fbuf_pos++;
    if(tmp_fbuf_pos >= TMP_FSTR_NUM)                   // Increment ringbuffer write position
    {
        tmp_fbuf_pos = 0;
    }
    return fstr_ptr;
}

/*********************************************************************
 * @fn      USB_Rx_readpacket
 *
 * @brief   Read the content of one USB RX packet (max. 64 Bytes) and copy it into a specified buffer.
 * 
 * @param   index Specify the index of the packet ([0:15]) or a negative number to let Tx_DealNum decide.
 * @param   buf Pointer to the buffer to copy contents of the USB RX packet into.
 * @param   sanitize Whether to reset contents inside copied USB RX packet to zero.
 *
 * @return  Number of characters read.
 */
uint16_t USB_Rx_readpacket(int16_t index, char * buf, uint8_t sanitize)
{
    uint16_t rx_count = 0;              // Return how many bytes were read

    if(index < 0)
    {
        index = Uart.Tx_DealNum;        // If Packet index is negative, use current DealNum index
    }

    // USB Interrupt deactivate
    USB_disable_IRQ();

    if(Uart.Tx_PackLen[index] > 0)
    {
        // Packet is not empty, copy content into buf
        memcpy(buf, (char*)&UART2_Tx_Buf[ ( index * DEF_USB_FS_PACK_LEN ) ], Uart.Tx_PackLen[index]);
        rx_count = Uart.Tx_PackLen[index];
        // If needed, sanitize data in packet to zero
        if(sanitize)
        {
            for(uint16_t i = (index * DEF_USB_FS_PACK_LEN); i < ((index + 1) * DEF_USB_FS_PACK_LEN); i++)
            {
                UART2_Tx_Buf[ i ] = 0;
            }
        }
        Uart.Tx_PackLen[index] = 0;     // Reset Packet length
        Uart.Tx_RemainNum--;            // One less Load to process now
        Uart.Tx_DealNum++;              // Increment number of next
        if( Uart.Tx_DealNum >= DEF_UARTx_TX_BUF_NUM_MAX )
        {
            Uart.Tx_DealNum = 0x00; // Wrap-around when limit of num of reads reached
        }     
    }

