KingKoro/CH32VX-USB-Serial-PIO-Library/lib/CH32V_USB_SERIAL/ch32v_usb_serial.c
    #if(USB_RX_OVERFLOW == USB_RX_HALT)
        /* If the current serial port has suspended the downlink, restart the driver downlink */
        if( ( Uart.USB_Down_StopFlag == 0x01 ) && ( Uart.Tx_RemainNum < 2 ) )
        {
            USB_restart_downlink();
        }
    #endif

    // USB Interrupt activate
    USB_enable_IRQ();

    return rx_count;
}

/*********************************************************************
 * @fn      USB_Rx_readfull
 *
 * @brief   Read and copy entire content of USB RX buffer, till eithe max_n number of bytes copied or no new RX data left.
 *          Data will still be received by the USB RX endpoint inbetween packet read-outs while this function is in action, 
 *          meaning that in high-traffic scenarios, it is more likely that the function will fill the specified buffer with max_n characters.
 * 
 * @param   buf Pointer to the buffer to copy contents of USB RX into.
 * @param   max_n Maximum number of characters/bytes to read.
 * @param   sanitize Whether to reset contents inside copied USB RX areas to zero.
 *
 * @return  Number of characters read.
 */
uint16_t USB_Rx_readfull(char * buf, uint16_t max_n, uint8_t sanitize)
{
    uint16_t rx_count = 0;              // Return how many bytes were read
    max_n -= DEF_USB_FS_PACK_LEN;       // Ensure Limits of buf are never overwritten
    while(Uart.Tx_RemainNum && rx_count < max_n)
    {
        // While Data on RX port, read it out until either all is processed or max_n of read bytes is reached
        rx_count += USB_Rx_readpacket(-1, (buf + rx_count), sanitize);
    }
    return rx_count;
}

/*********************************************************************
 * @fn      USB_Serial_scanf
 *
 * @brief   Similarly to scanf(), receive inputs from the USB serial port. Optionally call USB_Rx_flush() before invokation if needed.
 * 
 * @param   block Wether to flush receive buffer first and wait for new inputs by user (delimiter = '\n')
 * @param   format Format-string with specifiers for requested data-types.
 *
 * @return  Number of successfully parsed variables. Return EOF (-1) if receive buffer empty, return 0 if none parsed successfully.
 */
int USB_Serial_scanf(uint8_t block, char *format, ...)
{
    va_list args;                               // For declaration of list or arguments
    char rx_buf[USB_SCANF_BUF_SIZE];            // Buffer for received data
    uint16_t rx_buf_writeindex = 0;             // Receiver buffer write index

    // ---------- Buffer fill from USB RX ----------
    //If blocking enabled, first flush RX buffer and then wait till new data comes in
    if(block)
    {
        // Flush receive buffer
        //USB_Rx_flush();
        // Wait till delimiter char '\n' appears at ending of buffer or buffer limit is reached
        while(rx_buf[rx_buf_writeindex-1] != '\n')
        {
            while(!Uart.Tx_RemainNum)
            {
                // Wait for new data...
            }
            // Read new data
            uint16_t num_read_bytes = USB_Rx_readfull(&rx_buf[rx_buf_writeindex], (USB_SCANF_BUF_SIZE - rx_buf_writeindex), 0);
            rx_buf_writeindex += num_read_bytes;
            // Write read data into USB TX to give feedback to prompt
            #ifdef GETCH_CLI_FEEDBACK
                _USB_Serial_print_buffer(rx_buf, num_read_bytes, (rx_buf_writeindex - num_read_bytes));
            #endif
            // Buffer limit reached? -> leave while-loop
            if(rx_buf_writeindex >= USB_SCANF_BUF_SIZE)
            {
                break;
            }
        }
    }
    else
    {
        // If non-blocking, just read what's in receive buffer right now
        rx_buf_writeindex += USB_Rx_readfull(&rx_buf[0], (USB_SCANF_BUF_SIZE-1), 0);
    }
    // Append 0 to tell parser where end of input buf string is (override delimiter '\n')
    rx_buf[rx_buf_writeindex - 1] = 0;

    // ---------- Parsing ----------
    va_start(args, format);                     // Here you are starting your list from the format

    int num_parsed = vsscanf(rx_buf, format, args);

    va_end(args);
    return num_parsed;
}

/*********************************************************************
 * @fn      ratof
 *
 * @brief   Similarly to stdlib's atof() or strtod(), it converts a string of a FP32 double to a double variable. (But at much lower memory footprint)
 *          WARNING: This function skips all letters in a string, malformed float strings can result in unwanted behaviour.
 *          WARNING: Exponential floats are not accepted by this function (e.g. 10E-5 leads to 105).
 * 
 * @param   arr C String of represented double value
 *
 * @return  Double floating point value.
 */
double ratof(char *arr)
{
  double val = 0;
  int afterdot=0;
  double scale=1;
  int neg = 0; 

    // Handle negative floats
    if (*arr == '-') 
    {
        arr++;
        neg = 1;
    }
    while (*arr) 
    {
        if((*arr >= '0' && *arr <= '9') || *arr == '.') // Skip non-numbers and non-dots
        {
            if (afterdot)                               // Handle decimals
            {
                scale = scale/10;
                val = val + (*arr-'0')*scale;
            } 
            else 
            {
                if (*arr == '.')                        // Handle dot
                {
                    afterdot++;
                }
                else 
                {
                    val = val * 10.0 + (*arr - '0');    // Handle digits infront of dot
                }
            }
        }
        arr++;
    }
  if(neg) return -val;
  else    return  val;
}

/*********************************************************************
 * @fn      ratoff
 *
 * @brief   Similarly to stdlib's atoff(), it converts a string of a FP16 float to a float variable. (But at much lower memory footprint)
 *          WARNING: This function skips all letters in a string, malformed float strings can result in unwanted behaviour.
 *          WARNING: Exponential floats are not accepted by this function (e.g. 10E-5 leads to 105).
 * 
 * @param   arr C String of represented float value
 *
 * @return  Floating point value.
 */
float ratoff(char *arr)
{
  float val = 0;
  int afterdot=0;
  float scale=1;
  int neg = 0; 

    // Handle negative floats
    if (*arr == '-') 
    {
        arr++;
        neg = 1;
    }
    while (*arr) 
    {
        if((*arr >= '0' && *arr <= '9') || *arr == '.') // Skip non-numbers and non-dots
        {
            if (afterdot)                               // Handle decimals
            {
                scale = scale/10;
                val = val + (*arr-'0')*scale;
            } 
            else 
            {
                if (*arr == '.')                        // Handle dot
                {
                    afterdot++;
                }
                else 
                {
                    val = val * 10.0 + (*arr - '0');    // Handle digits infront of dot
                }
            }
        }
        arr++;
    }
  if(neg) return -val;
  else    return  val;
}
